public class Main {
    /*
    Написать программу-генератор "случайных" чисел
    1. С консоли вводим команду:
   - start - запуск процесса
   - max - задать максимальное значение случайного числа
   - get - получить значение случайного числа
   - stop - остановить процесс и выйти
    2. Генератор работает следующим образом:
    - бесконечный цикл от 0 до max (1000) (закольцевать)
    - между итерациями пауза 500 миллисекунд
    3. Ввод с консоли и генератор работают в параллельных потоках`
     */
    public static void main(String[] args) throws InterruptedException {
        Thread console = new ConsoleInputTask(); //создание консоли
        console.start(); //запуск потока консоли
        console.join(); //остановка потока консоли
    }
}